{
  "ast": null,
  "code": "export default {\n  partners: [{\n    id: 1,\n    account_manager: \"Ashley Ruiz\",\n    account_manager_email: \"ashleyr@mckinstry.com\",\n    account_manager_phone: \"206-832-2525\",\n    partner_type: \"Trading partner\",\n    account_manager_role: \"COO\",\n    Headquarters: \"5005 3rd Ave S, Seattle, WA 98134\",\n    business_description: `\n            McKinstry is a national leader in designing, constructing, operating and maintaining high-performing\n            buildings. From new construction and ongoing operations to adaptive reuse and energy retrofits, the\n            company provides a single point of accountability across the entire building lifecycle. McKinstry focuses\n            on people and outcomes to ensure the built environment serves owners, operators and occupants alike.\n            McKinstry is your trusted partner for the life of your building. Learn more at www.McKinstry.com.`,\n    business_name: \"McKinstry\",\n    city: \"Seattle\",\n    state: \"WA\",\n    commitments: `McKinstry is deeply committed to advancing equity and inclusion in our company and in the industry overall. We have added addressing the equity crisis as a top-line aspiration – one of only three – in our guiding 2025 plan. As part of this effort, we have developed a comprehensive five-year plan focused around advancing racial equity, strengthening inclusive jobsite culture, upskilling our people, building personal ownership, driving equity outcomes in local communities, and demonstrating durability and commitment. As part of this work, we have also committed to increasing engagement and spend with minority- and women-owned businesses.\n\n            For more than 40 years, McKinstry has participated in countless public projects that address the inclusion and development of disadvantaged businesses. Over the years, we have successfully subcontracted to, partnered with, and mentored many emerging firms – last year contracting over $50 million to MWDBE firms on projects nationwide. In December 2020, McKinstry became a leading signatory to the Washington Employers for Racial Equity commitment to advance racial equity across Washington, including by increasing investment to Black-owned businesses.`,\n    doing_business: \"There are no minimum requirements to do business with McKinstry\",\n    industry: \"Construction\",\n    logo: \"https://www.ecmag.com/sites/default/files/styles/article_medium/public/xml_uploads/unzipped/MTI-JPG-McKinstry_Logo_LARGE-2_0.jpg?itok=b9Q5hwZB\",\n    opportunities: [],\n    transactions: [],\n    website: \"https://www.mckinstry.com/\",\n    size: \"1001-5000 employees\",\n    founded: \"1960\"\n  }]\n};",
  "map": null,
  "metadata": {},
  "sourceType": "module"
}
